backend/app/controllers/application_controller.rb

  def current_user
    auth_header = request.headers['Authorization']
    if auth_header
      token = auth_header.split(' ')[1]
      secret = Rails.application.secret_key_base[0]
      begin
        @user_id = JWT.decode(token, secret)[0]['user_id']
      rescue JWT::DecodeError
        nil
      end
    end
    @user = User.find(@user_id) if @user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]