backend/app/controllers/communities_controller.rb

  def all_communities
    Community.all
---
SELECT "communities".* FROM "communities"

  def find_by_id
    Community.find(params[:id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @community = Community.new(community_params)
    if @community.valid?
      @community.save
---
INSERT INTO "communities" ("name", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)