backend/app/controllers/posts_controller.rb

    def get_user
        User.find(@post[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def get_community
        Community.find(@post[:community_id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]