backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def all_users
    User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_by_id
    User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Jack"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by({ username: login_params[:username] })

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save

SELECT "users".* FROM "users" WHERE (username LIKE '%a%')
---
  def search_by_username
    search_username = params[:search_criteria].downcase
    User.where( 'username LIKE ?', "%#{search_username}%")