backend/app/controllers/user_communities_controller.rb

SELECT "user_communities".* FROM "user_communities"
---
  def all_user_communities
    UserCommunity.all

SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_by_id
    UserCommunity.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_user
    User.find(@user_community[:user_id])

SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_community
    Community.find(@user_community[:community_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "user_communities" ("user_id", "community_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["community_id", 1], ["created_at", "2021-04-19 19:31:50.918929"], ["updated_at", "2021-04-19 19:31:50.918929"]]
---
  def create
    @user = User.find(user_community_params[:user_id])
    @community = Community.find(user_community_params[:community_id])

    if @user && @community
      @user_community = UserCommunity.new(user_community_params)
      if @user_community.valid?
        @user_community.save